app/controllers/images_controller.rb

  def create
    @image = Image.create(params[:image])
---
INSERT INTO `images` (`created_at`, `document_id`, `source`, `updated_at`) VALUES ('2013-03-29 21:06:36', NULL, '1.png', '2013-03-29 21:06:36')